# -*- org-confirm-babel-evaluate: nil -*-
#+title: Spacemacs Configuration
#+setupfile: headers
#+OPTIONS: auto-id:t
#+HTML_HEAD_EXTRA: <meta name="description" content="Phundrak’s Spacemacs Configuration" />
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Phundrak’s Spacemacs Configuration" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="Description of the Spacemacs configuration of Phundrak" />
#+PROPERTY: header-args: :mkdirp yes
#+STARTUP: content

*** Org capture
    :PROPERTIES:
    :CUSTOM_ID: User_Configuration-Org-mode-Org_capture-f58979cf
    :END:
    Org-capture is  an amazing feature  of Org-mode  which allows me  to quickly
    save links, resources,  reminders, and notes in neatly  organized org files.
    Here they are described:
    #+BEGIN_SRC emacs-lisp
      (setq
       org-conlanging-file "~/org/conlanging.org"
       org-default-notes-file "~/org/notes.org"
       org-journal-file "~/org/journal.org"
       org-linguistics-notes-file "~/org/linguistics-notes.org"
       org-novel-notes-file "~/org/novel-notes.org"
       org-private-agenda-file "~/org/agenda/private.org"
       org-school-agenda-file "~/org/agenda/school.org"
       org-wordbuilding-file "~/org/worldbuilding.org")
    #+END_SRC

    With Spacemacs, an Org capture can be invoked with the shortcut ~SPC a o c~.
    It  will then  ask which  template I  wish to  use. In  the table  below are
    described the shortcuts that are available after ~SPC a o c~ is invoked. The
    /name/ will be the one displayed  in Org capture’s interface, the /title/ is
    the headline  where to  save the  capture (if  it does  not differ  from the
    capture’s name,  the cell will be  blank). The /insertion mode/  tells Emacs
    how to add the capture to the /file/, using which /template/. A line with no
    insertion mode, file,  or template is just a category.  All of the following
    insert entries to  their org files, that  is a new org node  with a headline
    and some content.
    #+NAME: org-capture-shortcuts-table
    | Shortcut | Name          | Title  | Insertion mode | file                    | template                 |
    |----------+---------------+--------+----------------+-------------------------+--------------------------|
    | e        | Email         |        |                |                         |                          |
    | ew       | Write Email   | Emails | file+headline  | org-default-notes-file  | emails.orgcaptmpl        |
    | j        | Journal       |        | file+datetree  | org-journal-file        | journal.orgcaptmpl       |
    | l        | Link          |        |                |                         |                          |
    | ll       | General       |        | file+headline  | org-default-notes-file  |                          |
    | ly       | YouTube       |        | file+headline  | org-default-notes-file  | youtube.orgcaptmpl       |
    | L        | Protocol Link | Link   | file+headline  | org-default-notes-file  | protocol-link.orgcaptmpl |
    | n        | Notes         |        |                |                         |                          |
    | nc       | Note          |        | file+headline  | org-conlanging-file     | notes.orgcaptmpl         |
    | nn       | General       |        | file+headline  | org-default-notes-file  | notes.orgcaptmpl         |
    | nN       | Note          |        | file+headline  | org-novel-notes-file    | notes.orgcaptmpl         |
    | nq       | Quote         |        | file+headline  | org-default-notes-file  | notes-quote.orgcaptmpl   |
    | nw       | Note          |        | file+headline  | org-wordbuilding-file   | notes.orgcaptmpl         |
    | N        | Novel         |        |                |                         |                          |
    | Ni       | Ideas         |        | file+headline  | org-novel-notes-file    | notes.orgcaptmpl         |
    | p        | Protocol      | Link   | file+headline  | org-default-notes-file  | protocol.orgcaptmpl      |
    | r        | Resources     |        |                |                         |                          |
    | rc       | Resource      |        | file+headline  | org-conlanging-file     | resource.orgcaptmpl      |
    | re       | Emacs         |        | file+headline  | org-default-notes-file  | resource.orgcaptmpl      |
    | ri       | Informatique  |        | file+headline  | org-default-notes-file  | resource.orgcaptmpl      |
    | rl       | Linguistics   |        | file+headline  | org-default-notes-file  | resource.orgcaptmpl      |
    | rw       | Worldbuilding |        | file+headline  | org-wordbuilding-file   | resource.orgcaptmpl      |
    | t        | Tasks         |        |                |                         |                          |
    | tb       | Birthday      |        | file+headline  | org-private-agenda-file | birthday.orgcaptmpl      |
    | te       | Event         |        | file+headline  | org-private-agenda-file | event.orgcaptmpl         |
    | th       | Health        |        | file+headline  | org-private-agenda-file | health.orgcaptmpl        |
    | ti       | Informatique  |        | file+headline  | org-private-agenda-file | informatique.orgcaptmpl  |

    The following  code snipped is not  tangled into my configuration  file, but
    instead creates the equivalent to the  table above into EmacsLisp code found
    in the next code snippet.
    #+NAME: org-capture-shortcut-gen
    #+BEGIN_SRC emacs-lisp :tangle no :noweb yes :var table=org-capture-shortcuts-table :exports code :cache yes :results replace
      (mapconcat (lambda (entry)
                   (let* ((shortcut   (nth 0 entry))
                          (name       (nth 1 entry))
                          (title      (nth 2 entry))
                          (insertmode (nth 3 entry))
                          (fileinsert (nth 4 entry))
                          (sourceorg  (nth 5 entry)))
                     (if (string= "" insertmode)
                         (format "(\"%s\" \"%s\")" shortcut name)
                       (concat (format "(\"%s\" \"%s\" entry\n" shortcut name)
                               (format "  (%s %s%s)\n" insertmode fileinsert
                                       (if (string= "file+datetree" insertmode) ""
                                         (format " \"%s\"" (if (string= "" title) name title))))
                               (format "  (file \"~/org/capture/%s\"))" sourceorg)))) )
                 table "\n")
    #+END_SRC

    #+RESULTS[5ee3da858cb0dc430b6ca3b09d2deea38609aa5f]: org-capture-shortcut-gen
    #+begin_example
    ("e" "Email")
    ("ew" "Write Email" entry
      (file+headline org-default-notes-file "Emails")
      (file "~/org/capture/emails.orgcaptmpl"))
    ("j" "Journal" entry
      (file+datetree org-journal-file)
      (file "~/org/capture/journal.orgcaptmpl"))
    ("l" "Link")
    ("ll" "General" entry
      (file+headline org-default-notes-file "General")
      (file "~/org/capture/"))
    ("ly" "YouTube" entry
      (file+headline org-default-notes-file "YouTube")
      (file "~/org/capture/youtube.orgcaptmpl"))
    ("L" "Protocol Link" entry
      (file+headline org-default-notes-file "Link")
      (file "~/org/capture/protocol-link.orgcaptmpl"))
    ("n" "Notes")
    ("nc" "Note" entry
      (file+headline org-conlanging-file "Note")
      (file "~/org/capture/notes.orgcaptmpl"))
    ("nn" "General" entry
      (file+headline org-default-notes-file "General")
      (file "~/org/capture/notes.orgcaptmpl"))
    ("nN" "Note" entry
      (file+headline org-novel-notes-file "Note")
      (file "~/org/capture/notes.orgcaptmpl"))
    ("nq" "Quote" entry
      (file+headline org-default-notes-file "Quote")
      (file "~/org/capture/notes-quote.orgcaptmpl"))
    ("nw" "Note" entry
      (file+headline org-wordbuilding-file "Note")
      (file "~/org/capture/notes.orgcaptmpl"))
    ("N" "Novel")
    ("Ni" "Ideas" entry
      (file+headline org-novel-notes-file "Ideas")
      (file "~/org/capture/notes.orgcaptmpl"))
    ("p" "Protocol" entry
      (file+headline org-default-notes-file "Link")
      (file "~/org/capture/protocol.orgcaptmpl"))
    ("r" "Resources")
    ("rc" "Resource" entry
      (file+headline org-conlanging-file "Resource")
      (file "~/org/capture/resource.orgcaptmpl"))
    ("re" "Emacs" entry
      (file+headline org-default-notes-file "Emacs")
      (file "~/org/capture/resource.orgcaptmpl"))
    ("ri" "Informatique" entry
      (file+headline org-default-notes-file "Informatique")
      (file "~/org/capture/resource.orgcaptmpl"))
    ("rl" "Linguistics" entry
      (file+headline org-default-notes-file "Linguistics")
      (file "~/org/capture/resource.orgcaptmpl"))
    ("rw" "Worldbuilding" entry
      (file+headline org-wordbuilding-file "Worldbuilding")
      (file "~/org/capture/resource.orgcaptmpl"))
    ("t" "Tasks")
    ("tb" "Birthday" entry
      (file+headline org-private-agenda-file "Birthday")
      (file "~/org/capture/birthday.orgcaptmpl"))
    ("te" "Event" entry
      (file+headline org-private-agenda-file "Event")
      (file "~/org/capture/event.orgcaptmpl"))
    ("th" "Health" entry
      (file+headline org-private-agenda-file "Health")
      (file "~/org/capture/health.orgcaptmpl"))
    ("ti" "Informatique" entry
      (file+headline org-private-agenda-file "Informatique")
      (file "~/org/capture/informatique.orgcaptmpl"))
    #+end_example

    Below you can find the equivalent code as described above.
    #+BEGIN_SRC emacs-lisp :noweb yes
      (setq
       org-capture-templates
       '(
         <<org-capture-shortcut-gen()>>
         ))
    #+END_SRC

    You may notice a capture entry for my journal, and this is due to the fact I
    do  not use  ~org-journal~ anymore:  it was  too overpowered  for me,  and I
    prefer to keep it simple with a single  file. And as you can see, and unlike
    a lot of other Emacs configurations, the  content of the template is not set
    in  the variable,  but in  external files  which can  be modified  freely as
    actual Org buffers instead of trying to  get a proper one with loads of ~\n~
    characters and such. All these templates are declared below.

    In the next  sub-sections will be described my org  capture templates. These
    are  not  tangled into  my  Emacs  configuration  files, but  into  separate
    ~.orgcaptmpl~ files stored into =~/org/capture/=.

